---
type: VoltageTypeSet
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# VoltageTypeSet

`Autodesk.Revit.DB.Electrical.VoltageTypeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VoltageTypeSet | — | `public VoltageTypeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( VoltageType item )` |
| Method | Erase | — | `public virtual int Erase ( VoltageType item )` |
| Method | ForwardIterator | — | `public virtual VoltageTypeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( VoltageType item )` |
| Method | ReverseIterator | — | `public virtual VoltageTypeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |